# FamProfileDefinition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamProfileDefinition Property
ParameterTypeId Class See Also
---
"Profile Definition"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamProfileDefinition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamProfileDefinition As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamProfileDefinition {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace